---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.Description
source: html/bbca8f19-4d5e-1b6f-7366-b6d5322aaa5d.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.Description Property

The description of the window type.

## Syntax (C#)
```csharp
public string Description { get; }
```